:: (c) NorfiPC 2011 - http://norfipc.com
:: Use at your own risk. No warranty express or implied.
:: Permission granted to copy, distribute and modify, provided 
:: this message is not removed.
@echo off
mode con cols=56 
title Tabla de Caracteres para BATCH
echo.
echo ษออออออออออออออออออออออออออออออออออออออออออออออออออออป
echo บ  TABLA DE CARACTERES ASCII PARA PROGRAMAS BATCH  บ
echo ศออออออออออออออออออออออออออออออออออออออออออออออออออออผ
echo.
echo.
echo ษออออออออออออออออออออออออหออออออออออออออป
echo บ         Codigo         บ   Caracter   บ
echo ฬออออออออออออออออออออออออฮออออออออออออออน
echo บ Alt + 7--------------- บ      •       บ
echo บ Alt + 20-------------- บ      ถ       บ
echo บ Alt + 21-------------- บ      ง       บ
echo บ Alt + 32-------------- บ--------------บ     
echo บ Alt + 33-------------- บ      !       บ
echo บ Alt + 34-------------- บ      "       บ
echo บ Alt + 35-------------- บ      #       บ
echo บ Alt + 36-------------- บ      $       บ
echo บ Alt + 37-------------- บ  (porciento) บ
echo บ Alt + 38-------------- บ      ^&       บ
echo บ Alt + 39-------------- บ      '       บ
echo บ Alt + 40-------------- บ      (       บ
echo บ Alt + 41-------------- บ      )       บ
echo บ Alt + 42-------------- บ      *       บ
echo บ Alt + 43-------------- บ      +       บ
echo บ Alt + 44-------------- บ      ,       บ
echo บ Alt + 45-------------- บ      -       บ
echo บ Alt + 46-------------- บ      .       บ
echo บ Alt + 47-------------- บ      /       บ
echo บ Alt + 48-------------- บ      0       บ
echo บ Alt + 49-------------- บ      1       บ
echo บ Alt + 50-------------- บ      2       บ
echo บ Alt + 51-------------- บ      3       บ
echo บ Alt + 52-------------- บ      4       บ
echo บ Alt + 53-------------- บ      5       บ
echo บ Alt + 54-------------- บ      6       บ
echo บ Alt + 55-------------- บ      7       บ
echo บ Alt + 56-------------- บ      8       บ
echo บ Alt + 57-------------- บ      9       บ
echo บ Alt + 58-------------- บ      :       บ
echo บ Alt + 59-------------- บ      ;       บ
echo บ Alt + 60-------------- บ      ^<       บ
echo บ Alt + 61-------------- บ      =       บ
echo บ Alt + 62-------------- บ      ^>       บ
echo บ Alt + 63-------------- บ      ?       บ
echo บ Alt + 64-------------- บ       @      บ
echo บ Alt + 65-------------- บ      A       บ
echo บ Alt + 66-------------- บ      B       บ
echo บ Alt + 67-------------- บ      C       บ
echo บ Alt + 68-------------- บ      D       บ
echo บ Alt + 69-------------- บ      E       บ
echo บ Alt + 70-------------- บ      F       บ
echo บ Alt + 71-------------- บ      G       บ
echo บ Alt + 72-------------- บ      H       บ
echo บ Alt + 73-------------- บ      I       บ
echo บ Alt + 74-------------- บ      J       บ
echo บ Alt + 75-------------- บ      K       บ
echo บ Alt + 76-------------- บ      L       บ
echo บ Alt + 77-------------- บ      M       บ
echo บ Alt + 78-------------- บ      N       บ
echo บ Alt + 79-------------- บ      O       บ
echo บ Alt + 80-------------- บ      P       บ
echo บ Alt + 81-------------- บ      Q       บ
echo บ Alt + 82-------------- บ      R       บ
echo บ Alt + 83-------------- บ      S       บ
echo บ Alt + 84-------------- บ      T       บ
echo บ Alt + 85-------------- บ      U       บ
echo บ Alt + 86-------------- บ      V       บ
echo บ Alt + 87-------------- บ      W       บ
echo บ Alt + 88-------------- บ      X       บ
echo บ Alt + 89-------------- บ      Y       บ
echo บ Alt + 90-------------- บ      Z       บ
echo บ Alt + 91-------------- บ      [       บ
echo บ Alt + 92-------------- บ      \       บ
echo บ Alt + 93-------------- บ      ]       บ
echo บ Alt + 94-------------- บ      ^^       บ
echo บ Alt + 95-------------- บ      _       บ
echo บ Alt + 96-------------- บ      `       บ
echo บ Alt + 97-------------- บ      a       บ
echo บ Alt + 98-------------- บ      b       บ
echo บ Alt + 99-------------- บ      c       บ
echo บ Alt + 100--------------บ      d       บ
echo บ Alt + 101--------------บ      e       บ
echo บ Alt + 102--------------บ      f       บ
echo บ Alt + 103--------------บ      g       บ
echo บ Alt + 104--------------บ      h       บ
echo บ Alt + 105--------------บ      i       บ
echo บ Alt + 106--------------บ      j       บ
echo บ Alt + 107--------------บ      k       บ
echo บ Alt + 108--------------บ      l       บ
echo บ Alt + 109--------------บ      m       บ
echo บ Alt + 110--------------บ      n       บ
echo บ Alt + 111--------------บ      o       บ
echo บ Alt + 112--------------บ      p       บ
echo บ Alt + 113--------------บ      q       บ
echo บ Alt + 114--------------บ      r       บ
echo บ Alt + 115--------------บ      s       บ
echo บ Alt + 116--------------บ      t       บ
echo บ Alt + 117--------------บ      u       บ
echo บ Alt + 118--------------บ      v       บ
echo บ Alt + 119--------------บ      w       บ
echo บ Alt + 120--------------บ      x       บ
echo บ Alt + 121--------------บ      y       บ
echo บ Alt + 122--------------บ      z       บ
echo บ Alt + 123--------------บ      {       บ
echo บ Alt + 124--------------บ      ^|       บ
echo บ Alt + 125--------------บ      }       บ
echo บ Alt + 126--------------บ      ~       บ
echo บ Alt + 128--------------บ      ว       บ
echo บ Alt + 129--------------บ      ü       บ
echo บ Alt + 130--------------บ      ้       บ
echo บ Alt + 131--------------บ      โ       บ
echo บ Alt + 132--------------บ      ไ       บ
echo บ Alt + 133--------------บ      เ       บ
echo บ Alt + 134--------------บ      ๅ       บ
echo บ Alt + 135--------------บ      ็       บ
echo บ Alt + 136--------------บ      ๊       บ
echo บ Alt + 137--------------บ      ๋       บ
echo บ Alt + 138--------------บ      ่       บ
echo บ Alt + 139--------------บ      ๏       บ
echo บ Alt + 140--------------บ      ๎       บ
echo บ Alt + 141--------------บ      ์       บ
echo บ Alt + 142--------------บ      ฤ       บ
echo บ Alt + 143--------------บ      ล       บ
echo บ Alt + 144--------------บ      ษ       บ
echo บ Alt + 145--------------บ      ๆ       บ
echo บ Alt + 146--------------บ      ฦ       บ
echo บ Alt + 147--------------บ      ๔       บ
echo บ Alt + 148--------------บ      ๖       บ
echo บ Alt + 149--------------บ      ๒       บ
echo บ Alt + 150--------------บ      ๛       บ
echo บ Alt + 151--------------บ      ๙       บ
echo บ Alt + 153--------------บ      ึ       บ
echo บ Alt + 154--------------บ      Ü       บ
echo บ Alt + 155--------------บ      ๘       บ
echo บ Alt + 156--------------บ      ฃ       บ
echo บ Alt + 157--------------บ      ุ       บ
echo บ Alt + 158--------------บ      ื       บ
echo บ Alt + 159--------------บ             บ
echo บ Alt + 160--------------บ      แ       บ
echo บ Alt + 161--------------บ      ํ       บ
echo บ Alt + 162--------------บ      ๓       บ
echo บ Alt + 163--------------บ      ๚       บ
echo บ Alt + 164--------------บ      ๑       บ
echo บ Alt + 165--------------บ      ั       บ
echo บ Alt + 166--------------บ      ช       บ
echo บ Alt + 167--------------บ      บ       บ
echo บ Alt + 168--------------บ      ฟ       บ
echo บ Alt + 169--------------บ      ฎ       บ
echo บ Alt + 170--------------บ      ฌ       บ
echo บ Alt + 171--------------บ      ฝ       บ
echo บ Alt + 172--------------บ      ผ       บ
echo บ Alt + 173--------------บ      ก       บ
echo บ Alt + 174--------------บ      ซ       บ
echo บ Alt + 175--------------บ      ป       บ
echo บ Alt + 181--------------บ      ม       บ
echo บ Alt + 182--------------บ      ย       บ
echo บ Alt + 183--------------บ      ภ       บ
echo บ Alt + 184--------------บ      ฉ       บ
echo บ Alt + 189--------------บ      ข       บ
echo บ Alt + 190--------------บ      ฅ       บ
echo บ Alt + 198--------------บ      ใ       บ
echo บ Alt + 199--------------บ      ร       บ
echo บ Alt + 207--------------บ      ค       บ
echo บ Alt + 208--------------บ      ๐       บ
echo บ Alt + 209--------------บ      ะ       บ
echo บ Alt + 210--------------บ      ส       บ
echo บ Alt + 211--------------บ      ห       บ
echo บ Alt + 212--------------บ      ศ       บ
echo บ Alt + 214--------------บ      อ       บ
echo บ Alt + 215--------------บ      ฮ       บ
echo บ Alt + 216--------------บ      ฯ       บ
echo บ Alt + 221--------------บ      ฆ       บ
echo บ Alt + 222--------------บ      ฬ       บ
echo บ Alt + 224--------------บ      ำ       บ
echo บ Alt + 225--------------บ      ฿       บ
echo บ Alt + 226--------------บ      ิ       บ
echo บ Alt + 227--------------บ      า       บ
echo บ Alt + 228--------------บ      ๕       บ
echo บ Alt + 229--------------บ      ี       บ
echo บ Alt + 230--------------บ      ต       บ
echo บ Alt + 231--------------บ      þ       บ
echo บ Alt + 232--------------บ      Þ       บ
echo บ Alt + 233--------------บ      ฺ       บ
echo บ Alt + 234--------------บ      Û       บ
echo บ Alt + 235--------------บ      ู       บ
echo บ Alt + 236--------------บ      ý       บ
echo บ Alt + 237--------------บ      Ý       บ
echo บ Alt + 238--------------บ      ฏ       บ
echo บ Alt + 239--------------บ      ด       บ
echo บ Alt + 240--------------บ     ***      บ
echo บ Alt + 241--------------บ      ฑ       บ
echo บ Alt + 243--------------บ      พ       บ
echo บ Alt + 244--------------บ      ถ       บ
echo บ Alt + 245--------------บ      ง       บ
echo บ Alt + 246--------------บ      ๗       บ
echo บ Alt + 247--------------บ      ธ       บ
echo บ Alt + 248--------------บ      ฐ       บ
echo บ Alt + 249--------------บ      จ       บ
echo บ Alt + 250--------------บ      ท       บ
echo บ Alt + 251--------------บ      น       บ
echo บ Alt + 252--------------บ      ณ       บ
echo บ Alt + 253--------------บ      ฒ       บ
echo บ Alt + 255--------------บ--------------บ
echo ศออออออออออออออออออออออออสออออออออออออออผ
echo.
echo.
echo ษอออออออออออออออออออออออออออออออออออออออป
echo บ------ USADOS CON FRECUENCIA---------- บ
echo ฬอออออออออออออออออหอออออออออออออออออออออน
echo บ     Codigo      บ     Caracter        บ
echo ฬอออออออออออออฮอออออออออออออออออออออออออน
echo บ Alt + 230--------------บ      ต       บ
echo บ Alt + 255--------------บ--------------บ
echo บ Alt + 153--------------บ      ึ       บ
echo บ Alt + 173--------------บ      ก       บ
echo บ Alt + 133--------------บ      เ       บ
echo บ Alt + 189--------------บ      ข       บ
echo บ Alt + 130--------------บ      ้       บ
echo บ Alt + 412--------------บ      ฃ       บ
echo บ Alt + 190--------------บ      ฅ       บ
echo บ Alt + 207--------------บ      ค       บ
echo บ Alt + 249--------------บ      จ       บ
echo ศอออออออออออออออออออออออออสอออออออออออออผ
echo.
echo.
echo.
echo  EQU - igual
echo  NEQ - no igual
echo  LSS - menor que
echo  LEQ - menor que o igual
echo  GTR - mayor que
echo  GEQ - mayor que o igual
pause>nul